# Задача 1: Даны два файла в каждом из которых находится запись многочлена. 
# Сформировать файл содержащий сумму многочленов.



# Задача 2: Помните игру с конфетами из модуля "Математика и Информатика"? 
# Создайте такую игру для игры человек против человека
# а) Добавьте игру против бота
# b) Подумайте как наделить бота "интеллектом" 


# Задача 3: Реализовать RLE алгоритм. реализовать модуль сжатия и восстановления данных.
# а) входные и выходные данные хранятся в отдельных текстовых файлах
